app/Controllers/Driver.php

    public function index()
    {
        $currentPage = $this->request->getVar('page_drivers') ? $this->request->getVar('page_drivers') : 1;

        $keyword = $this->request->getVar('keyword');
        if($keyword){
            $search2 = $this->driverModel->search($keyword);
        } else {
            $search2 = $this->driverModel;
        }

        $data = [
            'title' => 'Our Drivers',
            'drivers' => $search2->paginate(5, 'drivers'),
---
SELECT *
FROM `drivers`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `drivers`