app/Controllers/Product.php

SELECT *
FROM `products`
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function index()
    {
        $currentPage = $this->request->getVar('page_products') ? $this->request->getVar('page_products') : 1;

        $keyword = $this->request->getVar('keyword');
        if($keyword){
            $search2 = $this->productModel->search($keyword);
        } else {
            $search2 = $this->productModel;
        }

        $data = [
            'title' => 'Our Products',
            'products' => $search2->paginate(3, 'products'),